Ran Plan for dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.gcloud-dns-record.google_dns_record_set.record will be created
+ resource "google_dns_record_set" "record" {
      + id           = (known after apply)
      + managed_zone = "ols.blast.co.id."
      + name         = "atlantis.ols.blast.co.id."
      + project      = (known after apply)
      + rrdatas      = [
          + "34.128.119.233",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.gcompute-engine.google_compute_instance.instance will be updated in-place
~ resource "google_compute_instance" "instance" {
        id                   = "projects/onlineshop-378118/zones/asia-southeast2-a/instances/ols-dev-gce-atlantis"
      ~ metadata             = {
          ~ "ssh-keys" = <<-EOT
                debian:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC8y2CsG2xeiPLCKuC4ZE1S5LxiBTHx6LaECs7L3rITDs+qFq0zbE523VAGbI1CpEXxGVuFblfejGrJ8RF4qV4n+1ApyFmfu/yJGM2sAj+Qwfn4/wKwxT/LefdVGyJTxy6lt1NnTvm/BDJHTDEJq8iZiQWP9QhFT45KiLA5u4MXZS8EsltLBv5NF+plQOW5RZLGEP7bjn+Ph2BLT6KckXsZCUQer06MV4fJnuMLVLZAJIwbFsdJ3dKvDH1HbYJtS+7mMC8O3V/GOkvmiATUYQONRbDjFqkRiNS9D/1+8pNGcGOqHz817B/pR1Y/87CothQphXFXUE2ywL0hP6cPwNRP
              - imam_arief_rhmn:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJmit9Fyvwihj4WuGoZscnjyXWauMlpE7pXan9iOvVz6RBJGCgwd8+DRHfayz2TgUImsXPgUnIPkV09m5yjup+Y= google-ssh {"userName":"imam.arief.rhmn@gmail.com","expireOn":"2023-08-21T08:38:56+0000"}
              - imam_arief_rhmn:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDhOtPm1L6bGFsP32OTinQNTwXUr2LV1HNQzhPHGqR30ukuqdvgxx//0A6X7Uhm3CI2jAx0UqhCSZp85rZzoj8HWpAS6B7hUTAxwSE0/JZULhTTYEuG+Oamk+RYKftemaWmTrI0gFZX9F7UbQUFx9R+n5I5BNCQSLGw/Bo9i62sbzC8/Hvd+s6UR/qTn9pMedMLA0vXMmqWRs0fx13RiWkC440yyiW+mhFr+UrlynJZ286xdJnOGgWmzZ3QhkN0dciLi7ARvRdThmlcjoBmyXieh6FvbB/AXbr0TRULHw0KIceyYIz931W2dDYTd3R1jJoprlgTz8OYViiURpCmNoE7 google-ssh {"userName":"imam.arief.rhmn@gmail.com","expireOn":"2023-08-21T08:39:11+0000"}
            EOT
        }
        name                 = "ols-dev-gce-atlantis"
        tags                 = [
            "atlantis",
        ]
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gcompute-engine.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "private_key.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ private_ip = "10.0.0.23"
+ public_ip  = "34.128.119.233"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgcompute-engine-atlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`